{
  "name": "Cjay Reed",
  "title": "Founder & Cinematographer",
  "bio": [
    "Cjay Cinematics was founded by Cjay Reed, a creative with a deep respect for family, culture, and meaningful moments. With a strong skill set in capturing photos and videos through modern technology, Cjay took initiative to develop his talent into purposeful storytelling.",
    "Through experience in funeral service environments and community-based events, Cjay found his calling in creating funeral cinematics work that prioritizes dignity, accuracy, and respect during life's most sensitive moments.",
    "Whether documenting a funeral service or a life celebration, the focus remains the same: preserving moments with care, intention, and respect for those involved.",
    "Cjay plans to finish EMS school and become an EMT. He plans to attend the University of Central Oklahoma and major in Funeral Science. In the future, Cjay also plans to become a firefighter and continue serving the community.",
    "Cjay currently works at Keith D. Biglow Funeral Home in Muskogee, Oklahoma, where he is gaining real experience working with families and learning the funeral service profession.",
    "Cjay also holds leadership roles in his school and community. He is the President of the Muskogee Alumni Chapter Kappa League, where he has been involved for seven years. He also serves as the Vice President of Business Professionals of America (BPA).",
    "Cjay is a senior at Muskogee High School and plans to graduate in May 2026."
  ],
  "photos": [
    {
      "url": "https://customer-assets.emergentagent.com/job_memorial-films/artifacts/ctc5nckp_IMG_5845.jpeg",
      "alt": "Cjay Reed - Founder"
    },
    {
      "url": "https://customer-assets.emergentagent.com/job_memorial-films/artifacts/cfal4njs_IMG_5153.jpeg",
      "alt": "Cjay Reed - Professional"
    },
    {
      "url": "https://customer-assets.emergentagent.com/job_memorial-films/artifacts/4v316ofa_IMG_5154.jpeg",
      "alt": "Cjay Reed - Cinematographer"
    },
    {
      "url": "https://customer-assets.emergentagent.com/job_memorial-films/artifacts/zco69ipl_IMG_0226.png",
      "alt": "Cjay Reed - Behind the Lens"
    },
    {
      "url": "https://customer-assets.emergentagent.com/job_memorial-films/artifacts/dpf5o94u_129A1529.jpeg",
      "alt": "Cjay Reed - Award Ceremony"
    },
    {
      "url": "https://customer-assets.emergentagent.com/job_memorial-films/artifacts/e8hki8mg_IMG_5866.jpeg",
      "alt": "Cjay Reed - Professional Portrait"
    },
    {
      "url": "https://customer-assets.emergentagent.com/job_memorial-films/artifacts/gpnhwmoc_IMG_5845.jpeg",
      "alt": "Cjay Reed - Suit Portrait"
    },
    {
      "url": "https://customer-assets.emergentagent.com/job_memorial-films/artifacts/z1gc71kf_IMG_5164.jpeg",
      "alt": "Cjay Reed - Detail Shot"
    }
  ]
}
